# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)

categories=[
           {level1:"レディース",level1_children:[
              {level2:"トップス",level2_children:["Tシャツ/カットソー(半袖/袖なし)", "Tシャツ/カットソー(七分/長袖)", "シャツ/ブラウス(半袖/袖なし)", "シャツ/ブラウス(七分/長袖)", "ポロシャツ", "キャミソール", "タンクトップ", "ホルターネック", "ニット/セーター", "チュニック", "カーディガン/ボレロ", "アンサンブル", "ベスト/ジレ", "パーカー", "トレーナー/スウェット", "ベアトップ/チューブトップ", "ジャージ", "その他"]},
              {level2:"ジャケット/アウター",level2_children:["テーラードジャケット", "ノーカラージャケット", "Gジャン/デニムジャケット", "レザージャケット", "ダウンジャケット", "ライダースジャケット", "ノーカラージャケット", "ミリタリージャケット", "ダウンベスト", "ジャンパー/ブルゾン", "ポンチョ", "ロングコート", "トレンチコート", "ダッフルコート", "ピーコート", "チェスターコート", "モッズコート", "スタジャン", "毛皮/ファーコート", "スプリングコート", "スカジャン", "その他"]},
              {level2:"パンツ",level2_children:["デニム/ジーンズ", "ショートパンツ", "カジュアルパンツ", "ハーフパンツ", "チノパン", "ワークパンツ/カーゴパンツ", "クロップドパンツ", "サロペット/オーバーオール", "オールインワン", "サルエルパンツ", "ガウチョパンツ", "その他"]},
              {level2:"スカート",level2_children:["ミニスカート", "ひざ丈スカート", "ロングスカート", "キュロット", "その他"]},
              {level2:"ワンピース",level2_children:["ミニワンピース", "ひざ丈ワンピース", "ロングワンピース", "その他"]},
              {level2:"靴",level2_children:["ハイヒール/パンプス", "ブーツ", "サンダル", "スニーカー", "ミュール", "モカシン", "ローファー/革靴", "フラットシューズ/バレエシューズ", "長靴/レインシューズ", "その他"]},
              {level2:"ルームウェア/パジャマ",level2_children:["パジャマ", "ルームウェア"]},
              {level2:"レッグウェア",level2_children:["ソックス", "スパッツ/レギンス"]},
              {level2:"帽子",level2_children:["ニットキャップ/ビーニー", "ハット", "ハンチング/ベレー帽", "キャップ", "キャスケット", "麦わら帽子", "その他"]},
              {level2:"バッグ",level2_children:["ハンドバッグ", "トートバッグ", "エコバッグ", "リュック/バックパック", "ボストンバッグ", "スポーツバッグ", "ショルダーバッグ", "クラッチバッグ", "ポーチ/バニティ", "ボディバッグ/ウェストバッグ", "マザーズバッグ", "メッセンジャーバッグ", "ビジネスバッグ", "旅行用バッグ/キャリーバッグ", "ショップ袋", "和装用バッグ", "かごバッグ", "その他"]},
              {level2:"アクセサリー",level2_children:["ネックレス", "ブレスレット", "バングル/リストバンド", "リング", "ピアス(片耳用)", "ピアス(両耳用)", "イヤリング", "アンクレット", "ブローチ/コサージュ", "チャーム", "その他"]},
              {level2:"ヘアアクセサリー",level2_children:["ヘアゴム/シュシュ", "ヘアバンド/カチューシャ", "ヘアピン", "その他"]},
              {level2:"小物",level2_children:["長財布", "折り財布", "コインケース/小銭入れ", "名刺入れ/定期入れ", "キーケース", "手袋/アームカバー", "ハンカチ", "ベルト", "マフラー/ショール", "ストール/スヌード", "バンダナ/スカーフ", "ネックウォーマー", "サスペンダー", "サングラス/メガネ", "モバイルケース/カバー", "手帳", "イヤマフラー", "傘", "レインコート/ポンチョ", "ミラー", "タバコグッズ", "その他"]},
              {level2:"時計",level2_children:["腕時計(アナログ)", "腕時計(デジタル)", "ラバーベルト", "レザーベルト", "金属ベルト", "その他"]},
              {level2:"ウィッグ/エクステ",level2_children:["前髪ウィッグ", "ロングストレート", "ロングカール", "ショートストレート", "ショートカール", "その他"]},
              {level2:"浴衣/水着",level2_children:["浴衣", "着物", "振袖", "長襦袢/半襦袢", "水着セパレート", "水着ワンピース", "水着スポーツ用", "その他"]},
              {level2:"スーツ/フォーマル/ドレス",level2_children:["スカートスーツ上下", "パンツスーツ上下", "ドレス", "パーティーバッグ", "シューズ", "ウェディング", "その他"]},
              {level2:"マタニティ",level2_children:["トップス", "アウター", "インナー", "ワンピース", "パンツ/スパッツ", "スカート", "パジャマ", "授乳服", "その他"]},
              {level2:"その他",level2_children:["テーラードジャケット", "ノーカラージャケット"]}
            ]
           },
           {level1:"メンズ",level1_children:[
              {level2:"トップス",level2_children:["Tシャツ/カットソー(半袖/袖なし)", "Tシャツ/カットソー(七分/長袖)", "シャツ", "ポロシャツ", "タンクトップ", "ニット/セーター", "パーカー", "カーディガン", "スウェット", "ジャージ", "ベスト", "その他"]},
              {level2:"ジャケット/アウター",level2_children:["テーラードジャケット", "ノーカラージャケット", "Gジャン/デニムジャケット", "レザージャケット", "ダウンジャケット", "ライダースジャケット", "ミリタリージャケット", "ナイロンジャケット", "フライトジャケット", "ダッフルコート", "ピーコート", "ステンカラーコート", "トレンチコート", "モッズコート", "チェスターコート", "スタジャン", "スカジャン", "ブルゾン", "マウンテンパーカー", "ダウンベスト", "ポンチョ", "カバーオール", "その他"]},
              {level2:"パンツ",level2_children:["デニム/ジーンズ", "ワークパンツ/カーゴパンツ", "スラックス", "チノパン", "ショートパンツ", "ペインターパンツ", "サルエルパンツ", "オーバーオール", "その他"]},
              {level2:"靴",level2_children:["スニーカー", "サンダル", "ブーツ", "モカシン", "ドレス/ビジネス", "長靴/レインシューズ", "デッキシューズ", "その他"]},
              {level2:"バッグ",level2_children:["ショルダーバッグ", "トートバッグ", "ボストンバッグ", "リュック/バックパック", "ウエストポーチ", "ボディーバッグ", "ドラムバッグ", "ビジネスバッグ", "トラベルバッグ", "メッセンジャーバッグ", "エコバッグ", "その他"]},
              {level2:"スーツ",level2_children:["スーツジャケット", "スーツベスト", "スラックス", "セットアップ", "その他"]},
              {level2:"帽子",level2_children:["キャップ", "ハット", "ニットキャップ/ビーニー", "ハンチング/ベレー帽", "キャスケット", "サンバイザー", "その他"]},
              {level2:"アクセサリー",level2_children:["ネックレス", "ブレスレット", "バングル/リストバンド", "リング", "ピアス(片耳用)", "ピアス(両耳用)", "アンクレット", "その他"]},
              {level2:"小物",level2_children:["長財布", "折り財布", "マネークリップ", "コインケース/小銭入れ", "名刺入れ/定期入れ", "キーケース", "キーホルダー", "ネクタイ", "手袋", "ハンカチ", "ベルト", "マフラー", "ストール", "バンダナ", "ネックウォーマー", "サスペンダー", "ウォレットチェーン", "サングラス/メガネ", "モバイルケース/カバー", "手帳", "ストラップ", "ネクタイピン", "カフリンクス", "イヤマフラー", "傘", "レインコート", "ミラー", "タバコグッズ", "その他"]},
              {level2:"時計",level2_children:["腕時計(アナログ)", "腕時計(デジタル)", "ラバーベルト", "レザーベルト", "金属ベルト", "その他"]},
              {level2:"水着",level2_children:["一般水着", "スポーツ用", "アクセサリー", "その他"]},
              {level2:"レッグウェア",level2_children:["ソックス", "レギンス/スパッツ", "レッグウォーマー", "その他"]},
              {level2:"アンダーウェア",level2_children:["トランクス", "ボクサーパンツ", "その他"]},
              {level2:"その他",level2_children:[]}
            ]
           },
           {level1:"ベビー・キッズ",level1_children:[
              {level2:"ベビー服(女の子用)~95cm",level2_children:["トップス", "アウター", "パンツ", "スカート", "ワンピース", "ベビードレス", "おくるみ", "下着/肌着", "パジャマ", "ロンパース", "その他"]},
              {level2:"ベビー服(男の子用)~95cm",level2_children:["トップス", "アウター", "パンツ", "おくるみ", "下着/肌着", "パジャマ", "ロンパース", "その他"]},
              {level2:"ベビー服(男女兼用)~95cm",level2_children:["トップス", "アウター", "パンツ", "おくるみ", "下着/肌着", "パジャマ", "ロンパース", "その他"]},
              {level2:"キッズ服(女の子用)~100cm",level2_children:["コート", "ジャケット/上着", "トップス(Tシャツ/カットソー)", "トップス(トレーナー)", "トップス(チュニック)", "トップス(タンクトップ)", "トップス(その他)", "スカート", "パンツ", "ワンピース", "セットアップ", "パジャマ", "フォーマル/ドレス", "和服", "浴衣", "甚平", "水着", "その他"]},
              {level2:"キッズ服(男の子用)~100cm",level2_children:["コート", "ジャケット/上着", "トップス(Tシャツ/カットソー)", "トップス(トレーナー)", "トップス(その他)", "パンツ", "セットアップ", "パジャマ", "フォーマル/ドレス", "和服", "浴衣", "甚平", "水着", "その他"]},
              {level2:"キッズ服(男女兼用)~100cm",level2_children:["コート", "ジャケット/上着", "トップス(Tシャツ/カットソー)", "トップス(トレーナー)", "トップス(その他)", "ボトムス", "パジャマ", "その他"]},
              {level2:"キッズ靴",level2_children:["スニーカー", "サンダル", "ブーツ", "長靴", "その他"]},
              {level2:"子供用ファッション小物",level2_children:["靴下/スパッツ", "帽子", "エプロン", "サスペンダー", "タイツ", "ハンカチ", "バンダナ", "ベルト", "マフラー", "傘", "手袋", "スタイ", "バッグ", "その他"]},
              {level2:"おむつ/トイレ/バス",level2_children:["おむつ用品", "おまる/補助便座", "トレーニングパンツ", "ベビーバス", "お風呂用品", "その他"]},
              {level2:"外出/移動用品",level2_children:["ベビーカー", "抱っこひも/スリング", "チャイルドシート", "その他"]},
              {level2:"授乳/食事",level2_children:["ミルク", "ベビーフード", "ベビー用食器", "その他"]},
              {level2:"ベビー家具/寝具/室内用品",level2_children:["ベット", "布団/毛布", "イス", "タンス", "その他"]},
              {level2:"おもちゃ",level2_children:["おふろのおもちゃ", "がらがら", "オルゴール", "ベビージム", "手押し車/カタカタ", "知育玩具", "その他"]},
              {level2:"行事/記念品",level2_children:["お宮参り用品", "", "カテゴリ 2-1-3"]},
              {level2:"その他",level2_children:["母子手帳用品", "その他"]}
            ]
           }
         ]

categories.each.with_index(1) do |category,i|
 level1_var="@category#{i}"                                                        #1階層の変数("@category1"等)
 level1_val= Category.create(title:"#{category[:level1]}")                          #1階層の値作成("カテゴリ 1"等)
 eval("#{level1_var} = level1_val")                                                #1階層の変数=1階層の値
   category[:level1_children].each.with_index(1) do |level1_child,j|
     level2_var="#{level1_var}_#{j}"                                               #2階層の変数("@category1-1"等)
     level2_val= eval("#{level1_var}.children.create(title:level1_child[:level2])") #2階層の値作成("カテゴリ 1-1"等)
     eval("#{level2_var} = level2_val")                                            #2階層の変数=2階層の値
       level1_child[:level2_children].each do |level2_children_val|
         eval("#{level2_var}.children.create(title:level2_children_val)")           #3階層の値作成("カテゴリ 1-1-1"等)
       end
   end
end
